{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "#": 4,
      "$": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      "+": 10,
      "-": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      ":": 23,
      "=": 24,
      "@": 25,
      "B": 26,
      "C": 27,
      "F": 28,
      "H": 29,
      "I": 30,
      "L": 31,
      "N": 32,
      "O": 33,
      "P": 34,
      "R": 35,
      "S": 36,
      "[": 37,
      "\\": 38,
      "]": 39,
      "a": 40,
      "b": 41,
      "c": 42,
      "f": 43,
      "h": 44,
      "l": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "u": 51,
      "cc": 52,
      "c1": 53,
      "CC": 54,
      "c1cc": 55,
      "c(": 56,
      ")C": 57,
      "=O": 58,
      "C(": 59,
      "=O)": 60,
      "c2": 61,
      "c1cccc": 62,
      "1)": 63,
      "c1ccc(": 64,
      "1CC": 65,
      "c1ccccc1": 66,
      "(=O)": 67,
      "(C": 68,
      "c1ccc(cc": 69,
      "1)C": 70,
      "C(=O)": 71,
      "c1n": 72,
      "CO": 73,
      "c(c1": 74,
      ")N": 75,
      "cn": 76,
      "=O)C": 77,
      "C1": 78,
      "CCCC": 79,
      "=C(": 80,
      ")O": 81,
      "n1": 82,
      "CN": 83,
      "(c1": 84,
      "c1ccc(cc1)": 85,
      "c(n": 86,
      "cccc": 87,
      "C(=O)C": 88,
      "(=O)N": 89,
      "O=C(": 90,
      "(CC": 91,
      "C)": 92,
      "OCC": 93,
      "Cl": 94,
      "c1ccc(cc1)C": 95,
      "c2c(c1": 96,
      "N1CC": 97,
      "c1cccc(c1": 98,
      "H]": 99,
      "[n": 100,
      "[nH]": 101,
      "F)": 102,
      "=C": 103,
      "C2": 104,
      "c1cccc2": 105,
      "(C)C": 106,
      "=N": 107,
      "c1cc(": 108,
      ")CC": 109,
      "c1c(": 110,
      "C)C": 111,
      "C1CC": 112,
      "cc(": 113,
      "CCN": 114,
      "CC1": 115,
      "C(=O)N": 116,
      "c1ccc2c(c1": 117,
      "S(=O)": 118,
      "cc2": 119,
      "Br": 120,
      "cc1": 121,
      "c(n1)": 122,
      "CCO": 123,
      "c2c(": 124,
      "c1nn": 125,
      "c2cccc": 126,
      "N(CC": 127,
      "CC(": 128,
      ")Cl": 129,
      "OC": 130,
      ")n": 131,
      "c2c1cccc2": 132,
      "cccc2": 133,
      "(F)": 134,
      "c1ccc": 135,
      "c1ccc(c(c1": 136,
      "c1cn": 137,
      "NC(=O)": 138,
      "=C1": 139,
      "CCC": 140,
      "O)": 141,
      "ccc1": 142,
      "2)": 143,
      "2)C": 144,
      "O=C(N": 145,
      "nc1": 146,
      "(=O)C": 147,
      "c1nc(": 148,
      "1)N": 149,
      "c1c": 150,
      "c1ccn": 151,
      "c(=O)": 152,
      "=CC": 153,
      "O)C": 154,
      "c2ccccc2": 155,
      "c(c2": 156,
      "N#": 157,
      "CCC1": 158,
      "OC(": 159,
      "c1cc(C": 160,
      "c1ccc(cc1": 161,
      "c1cc2": 162,
      "cnc1": 163,
      "c3": 164,
      "Cc1ccccc1": 165,
      "c1s": 166,
      "NC(=O)C": 167,
      "c1cccc(c1)C": 168,
      "n1n": 169,
      "c1ncc": 170,
      "CN1CC": 171,
      "OCC1": 172,
      "cnc2": 173,
      ")c1ccccc1": 174,
      "(=O)O": 175,
      "n2": 176,
      "c1ccc2c(c1)": 177,
      ")OC": 178,
      "CC(C": 179,
      "cc(c1": 180,
      "C1)": 181,
      "CC(=O)N": 182,
      "c1cccnc1": 183,
      "OC)": 184,
      "c2cc": 185,
      "c1ccccc1)C": 186,
      "O=C1": 187,
      "c1nnc(": 188,
      "NC(": 189,
      "(F)F": 190,
      "CC1CC": 191,
      "S(=O)(=O)": 192,
      "N(CC1)C": 193,
      "c1ccco": 194,
      "CCC(": 195,
      "S(=O)(=O)N": 196,
      "c2n": 197,
      "c1o": 198,
      "N(CC1)": 199,
      "OC(=O)": 200,
      "n1)": 201,
      "s1)": 202,
      "OC(=O)C": 203,
      "c1cccc(c1)": 204,
      "=S": 205,
      "ccc2": 206,
      "C(CC": 207,
      ")N1CC": 208,
      "CCCCCCCC": 209,
      "CCCN": 210,
      "c1c(C)": 211,
      "N1": 212,
      ")C(=O)N": 213,
      "N=C(": 214,
      "N(C": 215,
      "cccc1": 216,
      "n1)C": 217,
      "c2c(n1)": 218,
      "CN(C": 219,
      "CS": 220,
      "N(": 221,
      "COc1cc(": 222,
      "(C)": 223,
      "C(=O)O": 224,
      "N#C": 225,
      "c(cc2": 226,
      "c1ccc(cc1)Cl": 227,
      "COc1ccc(cc1)": 228,
      "c(n1)C": 229,
      "CN(CC": 230,
      "c1cccs": 231,
      "C(C1": 232,
      "c(nc1": 233,
      "NC": 234,
      "c1no": 235,
      "c1ncnc2": 236,
      "cn2": 237,
      "N=C": 238,
      "#N": 239,
      "O)O": 240,
      "o1)": 241,
      "COc1ccccc1": 242,
      ")C)C": 243,
      "(F)(F)F": 244,
      "c1cs": 245,
      "c1nc2c(": 246,
      "cn1": 247,
      "n(c1": 248,
      "c1[nH]": 249,
      "c1ccccc1)N": 250,
      "C(=N": 251,
      "c(cc1": 252,
      "n1cn": 253,
      "n1cc": 254,
      "c1ccc(cc1)F": 255,
      "n1c(": 256,
      "Cl)": 257,
      "c1ccco1": 258,
      "COc1ccc(cc1)C": 259,
      "O=": 260,
      "nc2": 261,
      "C(=O)C1": 262,
      "c1ccc(cc1)N": 263,
      "c1cc(C)": 264,
      "Oc1ccccc1": 265,
      ")NC(=O)": 266,
      "CCOC(=O)": 267,
      "OC1": 268,
      "c(c1)C": 269,
      "NCC": 270,
      "c1c[nH]": 271,
      "c1ccncc1": 272,
      "c1ccccc1)": 273,
      "Br)": 274,
      "COC(=O)": 275,
      "S(=O)(=O)C": 276,
      "(C(": 277,
      "CN1": 278,
      "SC": 279,
      "oc1": 280,
      "c1ccccn1": 281,
      "c1cccs1": 282,
      "c2c(C1)": 283,
      "CC2": 284,
      "C1=O)": 285,
      "(c2": 286,
      "c1ccc(c(c1)Cl": 287,
      "o1)C": 288,
      "=C1CC": 289,
      "N)": 290,
      "c1ccc2c(c1)O": 291,
      "c1ccc(c2": 292,
      "l)": 293,
      "c1ccccc1Cl": 294,
      "(C1": 295,
      "C=CC": 296,
      "CCN1CC": 297,
      "c(c1)": 298,
      "O=C(N1CC": 299,
      "cc(n1)C": 300,
      "c1on": 301,
      "2CC": 302,
      "s1)C": 303,
      "c1c2cccc": 304,
      ")C(=O)": 305,
      "c1ncc(": 306,
      "COc1ccc(cc1": 307,
      "CCN1": 308,
      "C)(C)C": 309,
      "C=": 310,
      "Cc1ccc(cc1)": 311,
      "C(C)C": 312,
      "C1=N": 313,
      "CCCC2": 314,
      "=S)N": 315,
      "C(=O)C(": 316,
      "c1cccc(c1)N": 317,
      "c(n1)N": 318,
      "c1n[nH]": 319,
      "COc1cc2": 320,
      "NC(=N": 321,
      "C(CC1)": 322,
      "C1)C": 323,
      "[nH]1)": 324,
      "CN(": 325,
      "c1ccc(c(c1)": 326,
      "c1c2": 327,
      "CCCC1": 328,
      "CCN(": 329,
      "C)N": 330,
      "nn1": 331,
      "c1nc(n": 332,
      "c2c(c1=O)": 333,
      "c1cccc(c1)O": 334,
      "c(c(c1": 335,
      "c1ccccc1F": 336,
      "=C(N": 337,
      "n1cnc2": 338,
      "c2ccc(cc2": 339,
      "(C)(C)C": 340,
      "N)n": 341,
      "ccc(c2": 342,
      "C(C1)": 343,
      ")O)O": 344,
      "c1ccc(cc1)O": 345,
      "c1ccc2c(c1)n": 346,
      "c1cc(Cl)": 347,
      ")S": 348,
      "c1ccc(nc1": 349,
      "c2c1cccc2)C": 350,
      "NC(=O)N": 351,
      "OCC1OC(": 352,
      "CC(=O)": 353,
      "C(F)": 354,
      "c2c1": 355,
      "Sc1nnc(": 356,
      "n(": 357,
      ")NC": 358,
      "c1ccc(cc1)OC": 359,
      "(O": 360,
      "C(C1O)O": 361,
      "[nH]2": 362,
      "=Cc1ccccc1": 363,
      "cc(n1)": 364,
      "CCC2": 365,
      ")C1": 366,
      "C(=O)N1CC": 367,
      "c(n2": 368,
      "c1co": 369,
      "c1cc2c(": 370,
      "cc1)": 371,
      "CC(CC": 372,
      "c1ccccc1)c1ccccc1": 373,
      "(C1CC": 374,
      "O=C1CC": 375,
      "Cl)Cl": 376,
      "N1CCN(CC1)C": 377,
      "c1c(C)n": 378,
      "c2cc1": 379,
      "1CCCCC1": 380,
      "cc(cc2": 381,
      "CCN(CC": 382,
      "COc1cc(ccc1": 383,
      "Cc1ccc(cc1)C": 384,
      "(C)CC": 385,
      "N1CCOCC1": 386,
      "(O)C": 387,
      "F)C": 388,
      "CCCCCC": 389,
      "O=C(C1CC": 390,
      "c1cccc(c1)Cl": 391,
      "(C)C)C": 392,
      "c1cc(ccc1": 393,
      "OC)C": 394,
      "n1nn": 395,
      "c1c2cccc1": 396,
      "N2": 397,
      "c1ccc(o1)C": 398,
      "CO2": 399,
      "n1c(=O)": 400,
      "O=C(C": 401,
      "c1cccc2c1": 402,
      "c1ccc(c(c1)C": 403,
      "CCS": 404,
      "1CCCC1": 405,
      "Clc1ccc(cc1)": 406,
      "Clc1ccc(cc1)C": 407,
      "c2c(C1=O)": 408,
      "Fc1ccc(cc1)": 409,
      "c(n2)": 410,
      "cn1)": 411,
      "CCC1)": 412,
      "c(C)": 413,
      "(C1)": 414,
      "c1ccc(cc1)Br": 415,
      "OCC1)C": 416,
      "CCOC(=O)C": 417,
      "(=N": 418,
      "c1ncn": 419,
      "cn1)C": 420,
      "N1CCN(CC1)": 421,
      "c1ccc2c(c1)CC": 422,
      "c1cnc(nc1": 423,
      "NC1CC": 424,
      ")NC(=O)C": 425,
      "(C)C)": 426,
      "c1ccc(c(c1)Cl)Cl": 427,
      "2)CC": 428,
      "3)": 429,
      "OC2": 430,
      "c2c1cc(": 431,
      "c1ccccc1C": 432,
      ")O)": 433,
      "c2c(c1)": 434,
      "cccc2)C": 435,
      "Fc1ccc(cc1)C": 436,
      "OC1CC": 437,
      "O)n": 438,
      ")O)C": 439,
      "c1cccc2c1cccc2": 440,
      "c1c(Cl)": 441,
      "CC(=O)C": 442,
      "CC(C1)": 443,
      "C(CC1)C": 444,
      "Oc1ccc(cc1)C": 445,
      "CCC(=O)N": 446,
      "C(=O)O)C": 447,
      "c1nc2": 448,
      "c1nn(": 449,
      "c2n(c1": 450,
      "c1ccc2c(c1)OCO2": 451,
      "cc1)C": 452,
      "c1cccc(": 453,
      "c1ccccc1)CC": 454,
      "c1ccc(cc1)S(=O)(=O)N": 455,
      "Cl)C": 456,
      "[nH]c1": 457,
      "CC(=C": 458,
      "(F)F)": 459,
      "c2ccccc2)": 460,
      "C(F)(F)F": 461,
      "COC(=O)C": 462,
      "n1cc(": 463,
      "O=C1N": 464,
      "CC1)": 465,
      "c2c1ccc(c2": 466,
      "n1C)": 467,
      "CNC(=O)": 468,
      "CCN(C": 469,
      "c1nc(C)": 470,
      "C3": 471,
      "C#N": 472,
      "O1)": 473,
      "Oc1ccc(cc1)": 474,
      "SC(": 475,
      "1CC1": 476,
      "COc1cc(C": 477,
      "c1ccc2c(c1)C": 478,
      "OC)O": 479,
      "=CC(=O)": 480,
      "c2c(n1)cccc2": 481,
      "#C": 482,
      "SCC(=O)N": 483,
      "CCc1ccccc1": 484,
      "CC1)C": 485,
      "CCNC(=O)": 486,
      "c2c(=O)": 487,
      "OC)OC": 488,
      "c1nccc2": 489,
      "N)C": 490,
      "NCC1": 491,
      "COc1c(": 492,
      "COc1cccc(c1)C": 493,
      "COc1ccc2c(c1)": 494,
      "C2(CC": 495,
      "C)C)C": 496,
      "c1cnn(c1": 497,
      "=CC1": 498,
      "NC1": 499,
      "s1": 500,
      "c2c3": 501,
      "c1ccccn1)": 502,
      "c1ccccc1)O": 503,
      ")NC1CC": 504,
      "CCCCC2": 505,
      "c1c(O)": 506,
      "Br)C": 507,
      "c1nnc(o1)": 508,
      "CN(C1)C": 509,
      "(=C": 510,
      "CCCN1CC": 511,
      "c1nc2c(s1)": 512,
      "1C": 513,
      "1=N": 514,
      "N1)": 515,
      "n2)": 516,
      "sc1": 517,
      "CC(=O)O": 518,
      "c1ccc(n": 519,
      "c1ccc(s1)C": 520,
      "CN2": 521,
      "OCCO": 522,
      "C1CC2": 523,
      "c1nnc2": 524,
      "c1cc(C)n": 525,
      ")F": 526,
      "Nc1nc(": 527,
      "NS(=O)(=O)": 528,
      "C(C1)C": 529,
      "(C2": 530,
      "c1ncccc1": 531,
      "CO1": 532,
      "c(nc2": 533,
      "(=O)N1CC": 534,
      "[nH]c2": 535,
      "2)C(=O)": 536,
      "c1nnc(s1)": 537,
      "=S)": 538,
      "C(C1O)O)": 539,
      "(CCCC": 540,
      "N1CCCCC1": 541,
      "c1cc(F)": 542,
      "c1cc(O)": 543,
      "cc(cc1": 544,
      "c1scc(n1)": 545,
      "cc(c1)C": 546,
      "N(C1)C": 547,
      "cccc1Cl": 548,
      "COc1cc(OC)": 549,
      "c1c[nH]c2c1cccc2": 550,
      "ON=C(": 551,
      ")Cc1ccccc1": 552,
      "C(=C": 553,
      "1CCN(CC1)C": 554,
      "c1ccccc1O": 555,
      "c1c(=O)": 556,
      "c1ccc(c(c1)OC": 557,
      "c1ccco1)": 558,
      ")Br": 559,
      "oc(=O)": 560,
      "c1cc(=O)": 561,
      "c(s": 562,
      ")C(=O)O": 563,
      "COC(=O)C1": 564,
      "F)F": 565,
      "c1cc(OC)": 566,
      ")CCC": 567,
      "CCC=": 568,
      "c1nccs1": 569,
      "c1noc(n1)C": 570,
      "c1nc2c([nH]1)": 571,
      "n1cncc1": 572,
      "1CO": 573,
      "2c(n1)": 574,
      "C(C2": 575,
      "CCCC(": 576,
      "OCC1)": 577,
      "c1cc(n": 578,
      "c1cc2cccc": 579,
      "c1ccc2c(c1)cccc2": 580,
      "N1C(=O)C": 581,
      "CCOCC": 582,
      "CCC1CC": 583,
      "c2c1cc": 584,
      "(C)O": 585,
      "CCCCC": 586,
      "c(n2)C": 587,
      "C)n": 588,
      "N1CCCC1": 589,
      "N1CCC(CC1)": 590,
      "c1[nH]n": 591,
      "n1cnc2c1ncnc2": 592,
      "(O)": 593,
      "N=C1": 594,
      "cs": 595,
      "CCCO": 596,
      "(C)C)N": 597,
      "c1c(F)": 598,
      "CCOc1ccccc1": 599,
      "CCC1)C": 600,
      "CN1CCN(CC1)": 601,
      "S(=O)(=O)N1CC": 602,
      "c1cc(C)ccc1": 603,
      "OCC1OC(C(C1O)O)": 604,
      "C=C": 605,
      "n2)C": 606,
      "C(=O)OCC": 607,
      "c1nc2ccccc2": 608,
      "O=C(C(": 609,
      "Clc1ccccc1": 610,
      "OCc1ccccc1": 611,
      "c1nc(N": 612,
      "c1scc(n1)C": 613,
      "NC(=S)N": 614,
      "COc1cc2c(cc1": 615,
      "NC(=N)N": 616,
      "(n1)": 617,
      "Cn1n": 618,
      "N)N": 619,
      "O)CC": 620,
      "n1)N": 621,
      "o2)C": 622,
      "c(O)": 623,
      "C(=S)N": 624,
      "(C1)C": 625,
      "c1ncn2": 626,
      "C1C2": 627,
      "CCCCC1": 628,
      "(=O)NC": 629,
      "OCC1CC": 630,
      "[nH]1": 631,
      "C1CCCCC1": 632,
      "cc(c2": 633,
      ")nc2": 634,
      "c1ccc(c(c1)O)O": 635,
      "c1ccc(cc1Cl)Cl": 636,
      "NC(=O)C1": 637,
      "c1ccco1)C": 638,
      "C(=O)O)N": 639,
      "c2c(c1=O)cccc2": 640,
      "Sc1nnc(n1": 641,
      "C2(CC1)": 642,
      "2C": 643,
      "C#": 644,
      "FC(": 645,
      "Oc1ccc2c(c1)": 646,
      "o2)": 647,
      "=NNC(=O)": 648,
      "c1c(c2": 649,
      "CCNC(=O)C": 650,
      "c2cccc(c2": 651,
      "c2c1cccc2)": 652,
      "c1cccs1)": 653,
      "c3c(": 654,
      "c1cccc(c1)C(F)(F)F": 655,
      "c1ncccn1": 656,
      "CN(C1)": 657,
      "c1cccc(n1)C": 658,
      "OCO": 659,
      "O=C": 660,
      "ONC(=O)": 661,
      "Sc1ccccc1": 662,
      "SC(=N": 663,
      "S=C(N": 664,
      "c1ccc2c(n1)": 665,
      "=O)N": 666,
      "c1ccccn1)C": 667,
      "c1ncc2": 668,
      "n1C": 669,
      "CNC(=O)C": 670,
      "cccc3": 671,
      "c1ccc(cc1)C1": 672,
      "c1ccc(cc1)C(=O)N": 673,
      "[nH]2)": 674,
      "[nH]c(=O)": 675,
      "(C)C)O": 676,
      "=NN": 677,
      "c2c(C1": 678,
      "cc(c1)": 679,
      "C(CC1)N": 680,
      "N1C(=O)": 681,
      "(O)CC": 682,
      "c2c(C1=O)cccc2": 683,
      "Sc1nn": 684,
      "C(C)(C)C": 685,
      "C(=O)O)": 686,
      "COc1cccc(c1)": 687,
      "C(=O)NC1CC": 688,
      "CCCS": 689,
      "N#CC1": 690,
      "OC(C)(C)C": 691,
      "c1sc2c(c1": 692,
      "CC(C1": 693,
      "c1cccnc1)C": 694,
      ")N1CCCC1": 695,
      "N(C(=O)": 696,
      "N#Cc1c(": 697,
      "c1cccs1)C": 698,
      "c1onc(c1": 699,
      "Fc1cccc(c1)C": 700,
      "NCCN": 701,
      "O)N": 702,
      "Oc1ccc(cc1": 703,
      "cc1)N": 704,
      ")C(=O)C": 705,
      "c1ccc(cn1)": 706,
      "c1nc": 707,
      "COc1ccc(c(c1": 708,
      "cn2)C": 709,
      "CCCCN": 710,
      "c1ccc(cc1)OCC": 711,
      "C)CC": 712,
      "CCO2": 713,
      "c1nnn(c1": 714,
      "c1sc(nc1": 715,
      "CN1CCN(CC1)C": 716,
      "c1ccc(cc1)F)C": 717,
      "c1onc(n1)": 718,
      "c(n2)N": 719,
      ")ccc1": 720,
      "=CN": 721,
      "Cc2": 722,
      "C)O": 723,
      "C1)N": 724,
      "Fc1ccccc1": 725,
      "CCn1c(": 726,
      "c(c(c2": 727,
      "c1ccc(cn1)C": 728,
      "(=O)O)C": 729,
      "c1ns": 730,
      "CCCC(=O)N": 731,
      "=C(C)C": 732,
      "n1c(n": 733,
      "c1ccc(cc1)NC(=O)": 734,
      "Clc1ccc(c(c1)Cl": 735,
      "N1CC2": 736,
      "C2)C": 737,
      "c1cc(Br)": 738,
      "c2c1cccc2)N": 739,
      "(=O)C=C": 740,
      "c1nc(N)n": 741,
      "Cc1ccccc1)C": 742,
      "c1ccco1)N": 743,
      ")N1CCN(CC1)C": 744,
      "c1ccc(cc1)Cl)C": 745,
      "c1nc2c(o1)": 746,
      "n1ccnc1": 747,
      "COc1ccc(cc1)C1": 748,
      "(C1=O)": 749,
      "2CC3": 750,
      "c1cc(Cl)ccc1": 751,
      "NC1=N": 752,
      "S=C(": 753,
      "s2": 754,
      "c1c2cc": 755,
      "C(C(=O)N": 756,
      "1CCN(CC1)": 757,
      "COC1": 758,
      "COC(=O)C(": 759,
      "cn2)": 760,
      "OCC(": 761,
      "c1cccc(c1)NC(=O)": 762,
      "C2C1": 763,
      "C(=O)N1": 764,
      "cc2c1": 765,
      "c2c(N1)": 766,
      "c1cnc(": 767,
      "c1cnn2": 768,
      "c1ccncc1)C": 769,
      "=CC2": 770,
      "CC1CCCO1": 771,
      "c1cccc(c1)F": 772,
      "c1cccs1)N": 773,
      "c1csc(n1)": 774,
      "O=S(=O)": 775,
      "n(c2": 776,
      "s1)N": 777,
      "cc3": 778,
      "c1cc(CC": 779,
      "(=O)c1ccccc1": 780,
      "(Cl": 781,
      "c1n2": 782,
      "COC(": 783,
      "C1CN": 784,
      "c1ccc(cc1)NC(=O)C": 785,
      "N1CCOCC1)C": 786,
      "C1CC1": 787,
      "cc(c(c2": 788,
      "CCOC(=O)C1": 789,
      ")nnc1": 790,
      "c2c1cccc2)c1ccccc1": 791,
      "cccc2)N": 792,
      "c(c2c1": 793,
      "c1sn": 794,
      "cc(c1OC)O": 795,
      "S(=O)(=O)c1ccccc1": 796,
      "c(cc1C)C": 797,
      "c1ccc2c(c1)OCCO2": 798,
      "COc1cc(ccc1OC)": 799,
      "c1ccc(nn1)": 800,
      "c1cc2ccccc2": 801,
      ")(C)C": 802,
      "Cc1cc(": 803,
      "Nc1ncnc2": 804,
      "o2": 805,
      "c1c(n": 806,
      "CCn1n": 807,
      "1CCCN1": 808,
      ")OC)C": 809,
      "ccccc3": 810,
      "O=C(CS": 811,
      "OCC(=O)N": 812,
      "C2=O)": 813,
      "c2c(O1)": 814,
      "CC(C(": 815,
      ")Cl)C": 816,
      "2)c1ccccc1": 817,
      "O=C(Nc1ccccc1": 818,
      "N#CC(=C": 819,
      "CC(=O)N1CC": 820,
      "CCCCCCCCCCCC": 821,
      "N(C1": 822,
      "C(F)(F)F)": 823,
      "c1cc2c(s1)": 824,
      "CCC=CCC=": 825,
      "COc1cc2c(cc1OC)": 826,
      "S=C1": 827,
      "cccn2": 828,
      "c1c2ccccc2": 829,
      "c1cccc3": 830,
      "c1ccccc1OC": 831,
      "(=O)OC": 832,
      "COCC": 833,
      "O=C(C1": 834,
      "c1cccc(c1)OC": 835,
      "c1ccc(c(c1)C)C": 836,
      "c1cnc2c(c1": 837,
      "NC(=O)c1ccccc1": 838,
      "O=C(NC": 839,
      "c1ccncc1)": 840,
      "c(c2)": 841,
      "n2C": 842,
      "CCCN(": 843,
      "COc1cc(cc(c1OC)O": 844,
      "c1onc(n1)C": 845,
      "c1c(Cl)cccc1Cl": 846,
      "c1nc2c([nH]1)cccc2": 847,
      "O=S(=O)(": 848,
      "(c(=O)": 849,
      "=CC(": 850,
      "C=C(": 851,
      "c4": 852,
      "c1ccsc1": 853,
      ")C)": 854,
      "c2n1n": 855,
      "COCCN": 856,
      ")Nc1ccccc1": 857,
      ")N(C)C": 858,
      ")OCC": 859,
      "C(=O)CS": 860,
      "Clc1cccc(c1)C": 861,
      "N1CCC(CC1)C": 862,
      "[nH]1)C": 863,
      "[nH]2)C": 864,
      "C)C(=O)N": 865,
      "cc2)": 866,
      "c1nn2": 867,
      "c1cncc(c1": 868,
      "ccc1C": 869,
      "O=C(NC1CC": 870,
      "c1nc(oc1": 871,
      "c1ccnc(c1": 872,
      "c3ccccc3": 873,
      "NC(=O)C(": 874,
      "c1nccc(n1)": 875,
      "n2c(": 876,
      "cc(c1OC)OC": 877,
      "c2n1CC": 878,
      "c2n(n1)": 879,
      "OC(=O)CC": 880,
      "c1cccc(c1)Br": 881,
      ")N1CCCCC1": 882,
      "N(C1)": 883,
      "c1noc(n1)": 884,
      "O=c1[nH]": 885,
      "2CCC1CC2": 886,
      "c1ncc(cc1": 887,
      "c1coc(n1)": 888,
      "1(=O)": 889,
      "Cc1cccc(c1)C": 890,
      "O2)": 891,
      "ccc(c1": 892,
      "c1c2n": 893,
      "CC=C": 894,
      "c1cccn1": 895,
      ")C#N": 896,
      "C(=O)c1ccccc1": 897,
      "c1nc2cccc": 898,
      "COC2": 899,
      "c(c1)c1ccccc1": 900,
      "Clc1cccc(c1)": 901,
      "C2)": 902,
      "(F)(F)F)": 903,
      "c1cncc": 904,
      "nc1N": 905,
      "N#CC(": 906,
      "NC(=O)C=C": 907,
      "CC(C1)C": 908,
      "CC1CC1": 909,
      "S(=O)(=O)c1ccc(cc1)C": 910,
      "N=C(N": 911,
      "N(C2)C": 912,
      "c1cscc1": 913,
      "n1cccn1": 914,
      "c2c(C1)cccc2": 915,
      "C=CC1": 916,
      "CCC2(C1CC": 917,
      "COc1c(OC)": 918,
      "(N": 919,
      "Nc2ccccc2": 920,
      "OCCCC": 921,
      "CCC(=O)": 922,
      "c(c(c1)C": 923,
      "C(CO": 924,
      ")OCc1ccccc1": 925,
      "n1ccc2": 926,
      "c1ccc(cc1)I": 927,
      "c1ccc(cc1)c1ccccc1": 928,
      "O=C(c1ccccc1)N": 929,
      "(CC1": 930,
      "C)c1ccccc1": 931,
      "OCC2": 932,
      "Clc1ccc2c(c1)": 933,
      "c1cccc(c1C)C": 934,
      "=C2": 935,
      "C1CCCC1": 936,
      "C(=O)NCC": 937,
      "c2c(o1)": 938,
      "CC(O": 939,
      "c1nc(N)": 940,
      "=CC(=O)N": 941,
      "c(c2)C": 942,
      "c1ccc(cc1C)C": 943,
      "c1nccn1": 944,
      "CC1CC2": 945,
      "c1occ(n1)C": 946,
      ")N1CCOCC1": 947,
      "c1c(C)cc(cc1": 948,
      ")C(=O)NC": 949,
      "CN(CC1)C": 950,
      "c1noc(c1": 951,
      "c1csc(n1)C": 952,
      "c1csc(n1)N": 953,
      "c1c2cc(": 954,
      "c1nn(c(c1": 955,
      "[nH]c1=O": 956,
      "COc1cc(OC)ccc1": 957,
      "C=N": 958,
      "Cc1cc(C)": 959,
      "SS": 960,
      "c[nH]2": 961,
      "oc2": 962,
      ")C1CC": 963,
      "C(N": 964,
      "C(=CC": 965,
      "C(N1": 966,
      "=O)c1ccccc1": 967,
      "c2cc(": 968,
      "1CC2": 969,
      "(C2)C": 970,
      "COC": 971,
      "C1=C(": 972,
      "n1cccc": 973,
      "CNC1": 974,
      "c1ccc(cc1)F)": 975,
      "O=C(CN1CC": 976,
      "c2c(c1C)": 977,
      "C2(": 978,
      "c1cccc2c1cc": 979,
      "c1cccc2c1nccc2": 980,
      "c1cc(nn1": 981,
      "CCO1": 982,
      "c1cn(": 983,
      "(=O)C(": 984,
      "c1ccncc1)N": 985,
      "c1sc(": 986,
      "CCCNC(=O)": 987,
      "C(C1O)": 988,
      "n(c1=O)C": 989,
      "n1c(C)": 990,
      "oc1C": 991,
      "C=CCN": 992,
      "C(C1O)O)O": 993,
      "c1cc2c(o1)": 994,
      "c1nc2c(s1)cccc2": 995,
      "c1nc(N)nc2": 996,
      "1N=C(": 997,
      "=CC(=O)C": 998,
      "Cc1ccc2c(c1)": 999,
      "I)": 1000,
      "ON=C": 1001,
      "SCC(": 1002,
      "n1CC": 1003,
      "cc(=O)": 1004,
      "CC(C)C": 1005,
      "c1ccc2c(n1)cccc2": 1006,
      "c1ccc2c3": 1007,
      "c(c3": 1008,
      "c(s1)": 1009,
      "c(=S)": 1010,
      ")C(": 1011,
      ")C)CC": 1012,
      "C(C)": 1013,
      "1CCCN(C1)C": 1014,
      "(Cl)": 1015,
      "c1n1": 1016,
      "c1nc2n(c1": 1017,
      "c(c1C)C": 1018,
      "CCCCCN": 1019,
      "n1cccc2": 1020,
      "OCC1)N": 1021,
      "Clc1ccc(cc1": 1022,
      "c1ccc(cc1)C(C)(C)C": 1023
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "c",
        "1"
      ],
      [
        "C",
        "C"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "c",
        "("
      ],
      [
        ")",
        "C"
      ],
      [
        "=",
        "O"
      ],
      [
        "C",
        "("
      ],
      [
        "=O",
        ")"
      ],
      [
        "c",
        "2"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "1",
        ")"
      ],
      [
        "c1cc",
        "c("
      ],
      [
        "1",
        "CC"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        "(",
        "=O)"
      ],
      [
        "(",
        "C"
      ],
      [
        "c1ccc(",
        "cc"
      ],
      [
        "1",
        ")C"
      ],
      [
        "C(",
        "=O)"
      ],
      [
        "c1",
        "n"
      ],
      [
        "C",
        "O"
      ],
      [
        "c(",
        "c1"
      ],
      [
        ")",
        "N"
      ],
      [
        "c",
        "n"
      ],
      [
        "=O",
        ")C"
      ],
      [
        "C",
        "1"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "=",
        "C("
      ],
      [
        ")",
        "O"
      ],
      [
        "n",
        "1"
      ],
      [
        "C",
        "N"
      ],
      [
        "(",
        "c1"
      ],
      [
        "c1ccc(cc",
        "1)"
      ],
      [
        "c(",
        "n"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "C(",
        "=O)C"
      ],
      [
        "(=O)",
        "N"
      ],
      [
        "O",
        "=C("
      ],
      [
        "(",
        "CC"
      ],
      [
        "C",
        ")"
      ],
      [
        "O",
        "CC"
      ],
      [
        "C",
        "l"
      ],
      [
        "c1ccc(cc",
        "1)C"
      ],
      [
        "c2",
        "c(c1"
      ],
      [
        "N",
        "1CC"
      ],
      [
        "c1cccc",
        "(c1"
      ],
      [
        "H",
        "]"
      ],
      [
        "[",
        "n"
      ],
      [
        "[n",
        "H]"
      ],
      [
        "F",
        ")"
      ],
      [
        "=",
        "C"
      ],
      [
        "C",
        "2"
      ],
      [
        "c1cccc",
        "2"
      ],
      [
        "(C",
        ")C"
      ],
      [
        "=",
        "N"
      ],
      [
        "c1cc",
        "("
      ],
      [
        ")",
        "CC"
      ],
      [
        "c1",
        "c("
      ],
      [
        "C",
        ")C"
      ],
      [
        "C",
        "1CC"
      ],
      [
        "cc",
        "("
      ],
      [
        "CC",
        "N"
      ],
      [
        "CC",
        "1"
      ],
      [
        "C(=O)",
        "N"
      ],
      [
        "c1cc",
        "c2c(c1"
      ],
      [
        "S",
        "(=O)"
      ],
      [
        "cc",
        "2"
      ],
      [
        "B",
        "r"
      ],
      [
        "cc",
        "1"
      ],
      [
        "c(n",
        "1)"
      ],
      [
        "CC",
        "O"
      ],
      [
        "c2",
        "c("
      ],
      [
        "c1n",
        "n"
      ],
      [
        "c2",
        "cccc"
      ],
      [
        "N",
        "(CC"
      ],
      [
        "CC",
        "("
      ],
      [
        ")C",
        "l"
      ],
      [
        "O",
        "C"
      ],
      [
        ")",
        "n"
      ],
      [
        "c2",
        "c1cccc2"
      ],
      [
        "cccc",
        "2"
      ],
      [
        "(",
        "F)"
      ],
      [
        "c1cc",
        "c"
      ],
      [
        "c1ccc(",
        "c(c1"
      ],
      [
        "c1",
        "cn"
      ],
      [
        "N",
        "C(=O)"
      ],
      [
        "=",
        "C1"
      ],
      [
        "CC",
        "C"
      ],
      [
        "O",
        ")"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "2",
        ")"
      ],
      [
        "2",
        ")C"
      ],
      [
        "O=C(",
        "N"
      ],
      [
        "n",
        "c1"
      ],
      [
        "(",
        "=O)C"
      ],
      [
        "c1n",
        "c("
      ],
      [
        "1)",
        "N"
      ],
      [
        "c1",
        "c"
      ],
      [
        "c1cc",
        "n"
      ],
      [
        "c(",
        "=O)"
      ],
      [
        "=",
        "CC"
      ],
      [
        "O",
        ")C"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "c(",
        "c2"
      ],
      [
        "N",
        "#"
      ],
      [
        "CC",
        "C1"
      ],
      [
        "O",
        "C("
      ],
      [
        "c1cc",
        "(C"
      ],
      [
        "c1ccc(cc",
        "1"
      ],
      [
        "c1cc",
        "2"
      ],
      [
        "cn",
        "c1"
      ],
      [
        "c",
        "3"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "c1",
        "s"
      ],
      [
        "N",
        "C(=O)C"
      ],
      [
        "c1cccc(c1",
        ")C"
      ],
      [
        "n1",
        "n"
      ],
      [
        "c1n",
        "cc"
      ],
      [
        "CN",
        "1CC"
      ],
      [
        "OCC",
        "1"
      ],
      [
        "cn",
        "c2"
      ],
      [
        ")",
        "c1ccccc1"
      ],
      [
        "(=O)",
        "O"
      ],
      [
        "n",
        "2"
      ],
      [
        "c1ccc2c(c1",
        ")"
      ],
      [
        ")O",
        "C"
      ],
      [
        "CC",
        "(C"
      ],
      [
        "cc",
        "(c1"
      ],
      [
        "C",
        "1)"
      ],
      [
        "CC",
        "(=O)N"
      ],
      [
        "c1cc",
        "cnc1"
      ],
      [
        "O",
        "C)"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "c1ccccc1",
        ")C"
      ],
      [
        "O",
        "=C1"
      ],
      [
        "c1nn",
        "c("
      ],
      [
        "N",
        "C("
      ],
      [
        "(F)",
        "F"
      ],
      [
        "CC",
        "1CC"
      ],
      [
        "S(=O)",
        "(=O)"
      ],
      [
        "N(CC",
        "1)C"
      ],
      [
        "c1ccc",
        "o"
      ],
      [
        "CC",
        "C("
      ],
      [
        "S(=O)",
        "(=O)N"
      ],
      [
        "c2",
        "n"
      ],
      [
        "c1",
        "o"
      ],
      [
        "N(CC",
        "1)"
      ],
      [
        "O",
        "C(=O)"
      ],
      [
        "n",
        "1)"
      ],
      [
        "s",
        "1)"
      ],
      [
        "O",
        "C(=O)C"
      ],
      [
        "c1cccc(c1",
        ")"
      ],
      [
        "=",
        "S"
      ],
      [
        "cc",
        "c2"
      ],
      [
        "C(",
        "CC"
      ],
      [
        ")N",
        "1CC"
      ],
      [
        "CCCC",
        "CCCC"
      ],
      [
        "CC",
        "CN"
      ],
      [
        "c1c(",
        "C)"
      ],
      [
        "N",
        "1"
      ],
      [
        ")C",
        "(=O)N"
      ],
      [
        "N",
        "=C("
      ],
      [
        "N",
        "(C"
      ],
      [
        "cccc",
        "1"
      ],
      [
        "n",
        "1)C"
      ],
      [
        "c2",
        "c(n1)"
      ],
      [
        "CN",
        "(C"
      ],
      [
        "C",
        "S"
      ],
      [
        "N",
        "("
      ],
      [
        "CO",
        "c1cc("
      ],
      [
        "(C",
        ")"
      ],
      [
        "C(=O)",
        "O"
      ],
      [
        "N#",
        "C"
      ],
      [
        "c(",
        "cc2"
      ],
      [
        "c1ccc(cc1)C",
        "l"
      ],
      [
        "CO",
        "c1ccc(cc1)"
      ],
      [
        "c(n",
        "1)C"
      ],
      [
        "CN",
        "(CC"
      ],
      [
        "c1ccc",
        "s"
      ],
      [
        "C(",
        "C1"
      ],
      [
        "c(n",
        "c1"
      ],
      [
        "N",
        "C"
      ],
      [
        "c1n",
        "o"
      ],
      [
        "c1n",
        "cnc2"
      ],
      [
        "cn",
        "2"
      ],
      [
        "N",
        "=C"
      ],
      [
        "#",
        "N"
      ],
      [
        "O",
        ")O"
      ],
      [
        "o",
        "1)"
      ],
      [
        "CO",
        "c1ccccc1"
      ],
      [
        ")C",
        ")C"
      ],
      [
        "(F)",
        "(F)F"
      ],
      [
        "c1c",
        "s"
      ],
      [
        "c1n",
        "c2c("
      ],
      [
        "cn",
        "1"
      ],
      [
        "n",
        "(c1"
      ],
      [
        "c1",
        "[nH]"
      ],
      [
        "c1ccccc1",
        ")N"
      ],
      [
        "C(",
        "=N"
      ],
      [
        "c(",
        "cc1"
      ],
      [
        "n1",
        "cn"
      ],
      [
        "n1",
        "cc"
      ],
      [
        "c1ccc(cc1)",
        "F"
      ],
      [
        "n1",
        "c("
      ],
      [
        "Cl",
        ")"
      ],
      [
        "c1ccco",
        "1"
      ],
      [
        "CO",
        "c1ccc(cc1)C"
      ],
      [
        "O",
        "="
      ],
      [
        "n",
        "c2"
      ],
      [
        "C(=O)C",
        "1"
      ],
      [
        "c1ccc(cc1)",
        "N"
      ],
      [
        "c1cc(C",
        ")"
      ],
      [
        "O",
        "c1ccccc1"
      ],
      [
        ")N",
        "C(=O)"
      ],
      [
        "CCO",
        "C(=O)"
      ],
      [
        "O",
        "C1"
      ],
      [
        "c(c1",
        ")C"
      ],
      [
        "N",
        "CC"
      ],
      [
        "c1c",
        "[nH]"
      ],
      [
        "c1ccn",
        "cc1"
      ],
      [
        "c1ccccc1",
        ")"
      ],
      [
        "Br",
        ")"
      ],
      [
        "CO",
        "C(=O)"
      ],
      [
        "S(=O)",
        "(=O)C"
      ],
      [
        "(",
        "C("
      ],
      [
        "CN",
        "1"
      ],
      [
        "S",
        "C"
      ],
      [
        "o",
        "c1"
      ],
      [
        "c1cccc",
        "n1"
      ],
      [
        "c1cccs",
        "1"
      ],
      [
        "c2c(",
        "C1)"
      ],
      [
        "CC",
        "2"
      ],
      [
        "C1",
        "=O)"
      ],
      [
        "(",
        "c2"
      ],
      [
        "c1ccc(c(c1",
        ")Cl"
      ],
      [
        "o",
        "1)C"
      ],
      [
        "=C",
        "1CC"
      ],
      [
        "N",
        ")"
      ],
      [
        "c1ccc2c(c1",
        ")O"
      ],
      [
        "c1ccc(",
        "c2"
      ],
      [
        "l",
        ")"
      ],
      [
        "c1ccccc1",
        "Cl"
      ],
      [
        "(C",
        "1"
      ],
      [
        "C",
        "=CC"
      ],
      [
        "CC",
        "N1CC"
      ],
      [
        "c(c1",
        ")"
      ],
      [
        "O=C(",
        "N1CC"
      ],
      [
        "cc(",
        "n1)C"
      ],
      [
        "c1o",
        "n"
      ],
      [
        "2",
        "CC"
      ],
      [
        "s",
        "1)C"
      ],
      [
        "c1",
        "c2cccc"
      ],
      [
        ")C",
        "(=O)"
      ],
      [
        "c1n",
        "cc("
      ],
      [
        "CO",
        "c1ccc(cc1"
      ],
      [
        "CCN",
        "1"
      ],
      [
        "C)",
        "(C)C"
      ],
      [
        "C",
        "="
      ],
      [
        "C",
        "c1ccc(cc1)"
      ],
      [
        "C(",
        "C)C"
      ],
      [
        "C1",
        "=N"
      ],
      [
        "CCCC",
        "2"
      ],
      [
        "=S",
        ")N"
      ],
      [
        "C(=O)C",
        "("
      ],
      [
        "c1cccc(c1",
        ")N"
      ],
      [
        "c(n1)",
        "N"
      ],
      [
        "c1n",
        "[nH]"
      ],
      [
        "CO",
        "c1cc2"
      ],
      [
        "NC(",
        "=N"
      ],
      [
        "C(CC",
        "1)"
      ],
      [
        "C",
        "1)C"
      ],
      [
        "[nH]",
        "1)"
      ],
      [
        "CN",
        "("
      ],
      [
        "c1ccc(c(c1",
        ")"
      ],
      [
        "c1",
        "c2"
      ],
      [
        "CCCC",
        "1"
      ],
      [
        "CCN",
        "("
      ],
      [
        "C",
        ")N"
      ],
      [
        "n",
        "n1"
      ],
      [
        "c1n",
        "c(n"
      ],
      [
        "c2c(c1",
        "=O)"
      ],
      [
        "c1cccc(c1",
        ")O"
      ],
      [
        "c(",
        "c(c1"
      ],
      [
        "c1ccccc1",
        "F"
      ],
      [
        "=C(",
        "N"
      ],
      [
        "n1",
        "cnc2"
      ],
      [
        "c2cc",
        "c(cc2"
      ],
      [
        "(C)",
        "(C)C"
      ],
      [
        "N",
        ")n"
      ],
      [
        "cc",
        "c(c2"
      ],
      [
        "C(",
        "C1)"
      ],
      [
        ")O",
        ")O"
      ],
      [
        "c1ccc(cc1)",
        "O"
      ],
      [
        "c1ccc2c(c1",
        ")n"
      ],
      [
        "c1cc(C",
        "l)"
      ],
      [
        ")",
        "S"
      ],
      [
        "c1ccc(",
        "nc1"
      ],
      [
        "c2c1cccc2",
        ")C"
      ],
      [
        "N",
        "C(=O)N"
      ],
      [
        "OCC1",
        "OC("
      ],
      [
        "CC",
        "(=O)"
      ],
      [
        "C(",
        "F)"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "S",
        "c1nnc("
      ],
      [
        "n",
        "("
      ],
      [
        ")N",
        "C"
      ],
      [
        "c1ccc(cc1)",
        "OC"
      ],
      [
        "(",
        "O"
      ],
      [
        "C(C1",
        "O)O"
      ],
      [
        "[nH]",
        "2"
      ],
      [
        "=C",
        "c1ccccc1"
      ],
      [
        "cc(",
        "n1)"
      ],
      [
        "CC",
        "C2"
      ],
      [
        ")C",
        "1"
      ],
      [
        "C(=O)",
        "N1CC"
      ],
      [
        "c(n",
        "2"
      ],
      [
        "c1c",
        "o"
      ],
      [
        "c1cc2",
        "c("
      ],
      [
        "cc",
        "1)"
      ],
      [
        "CC",
        "(CC"
      ],
      [
        "c1ccccc1",
        ")c1ccccc1"
      ],
      [
        "(C",
        "1CC"
      ],
      [
        "O",
        "=C1CC"
      ],
      [
        "Cl",
        ")Cl"
      ],
      [
        "N1CC",
        "N(CC1)C"
      ],
      [
        "c1c(C)",
        "n"
      ],
      [
        "c2",
        "cc1"
      ],
      [
        "1CC",
        "CCC1"
      ],
      [
        "cc(",
        "cc2"
      ],
      [
        "CCN",
        "(CC"
      ],
      [
        "COc1cc(",
        "ccc1"
      ],
      [
        "C",
        "c1ccc(cc1)C"
      ],
      [
        "(C",
        ")CC"
      ],
      [
        "N1CC",
        "OCC1"
      ],
      [
        "(",
        "O)C"
      ],
      [
        "F",
        ")C"
      ],
      [
        "CCCC",
        "CC"
      ],
      [
        "O=C(",
        "C1CC"
      ],
      [
        "c1cccc(c1",
        ")Cl"
      ],
      [
        "(C)C",
        ")C"
      ],
      [
        "c1cc(",
        "ccc1"
      ],
      [
        "O",
        "C)C"
      ],
      [
        "n1n",
        "n"
      ],
      [
        "c1c2cccc",
        "1"
      ],
      [
        "N",
        "2"
      ],
      [
        "c1ccc(",
        "o1)C"
      ],
      [
        "CO",
        "2"
      ],
      [
        "n1",
        "c(=O)"
      ],
      [
        "O=C(",
        "C"
      ],
      [
        "c1cccc2",
        "c1"
      ],
      [
        "c1ccc(c(c1",
        ")C"
      ],
      [
        "CC",
        "S"
      ],
      [
        "1CC",
        "CC1"
      ],
      [
        "Cl",
        "c1ccc(cc1)"
      ],
      [
        "Cl",
        "c1ccc(cc1)C"
      ],
      [
        "c2c(",
        "C1=O)"
      ],
      [
        "F",
        "c1ccc(cc1)"
      ],
      [
        "c(n",
        "2)"
      ],
      [
        "cn",
        "1)"
      ],
      [
        "CCC",
        "1)"
      ],
      [
        "c(",
        "C)"
      ],
      [
        "(C",
        "1)"
      ],
      [
        "c1ccc(cc1)",
        "Br"
      ],
      [
        "OCC",
        "1)C"
      ],
      [
        "CCO",
        "C(=O)C"
      ],
      [
        "(",
        "=N"
      ],
      [
        "c1n",
        "cn"
      ],
      [
        "cn",
        "1)C"
      ],
      [
        "N1CC",
        "N(CC1)"
      ],
      [
        "c1ccc2c(c1",
        ")CC"
      ],
      [
        "c1cn",
        "c(nc1"
      ],
      [
        "N",
        "C1CC"
      ],
      [
        ")N",
        "C(=O)C"
      ],
      [
        "(C)C",
        ")"
      ],
      [
        "c1ccc(c(c1)Cl",
        ")Cl"
      ],
      [
        "2",
        ")CC"
      ],
      [
        "3",
        ")"
      ],
      [
        "O",
        "C2"
      ],
      [
        "c2",
        "c1cc("
      ],
      [
        "c1ccccc1",
        "C"
      ],
      [
        ")O",
        ")"
      ],
      [
        "c2c(c1",
        ")"
      ],
      [
        "cccc2",
        ")C"
      ],
      [
        "F",
        "c1ccc(cc1)C"
      ],
      [
        "O",
        "C1CC"
      ],
      [
        "O",
        ")n"
      ],
      [
        ")O",
        ")C"
      ],
      [
        "c1cccc2",
        "c1cccc2"
      ],
      [
        "c1c(",
        "Cl)"
      ],
      [
        "CC(",
        "=O)C"
      ],
      [
        "CC(C",
        "1)"
      ],
      [
        "C(CC",
        "1)C"
      ],
      [
        "O",
        "c1ccc(cc1)C"
      ],
      [
        "CC",
        "C(=O)N"
      ],
      [
        "C(=O)",
        "O)C"
      ],
      [
        "c1n",
        "c2"
      ],
      [
        "c1nn",
        "("
      ],
      [
        "c2n",
        "(c1"
      ],
      [
        "c1ccc2c(c1)O",
        "CO2"
      ],
      [
        "cc",
        "1)C"
      ],
      [
        "c1cccc",
        "("
      ],
      [
        "c1ccccc1",
        ")CC"
      ],
      [
        "c1ccc(cc1)",
        "S(=O)(=O)N"
      ],
      [
        "Cl",
        ")C"
      ],
      [
        "[nH]",
        "c1"
      ],
      [
        "CC(",
        "=C"
      ],
      [
        "(F)",
        "F)"
      ],
      [
        "c2ccccc2",
        ")"
      ],
      [
        "C(F)",
        "(F)F"
      ],
      [
        "CO",
        "C(=O)C"
      ],
      [
        "n1",
        "cc("
      ],
      [
        "O=C1",
        "N"
      ],
      [
        "CC",
        "1)"
      ],
      [
        "c2",
        "c1ccc(c2"
      ],
      [
        "n1",
        "C)"
      ],
      [
        "CN",
        "C(=O)"
      ],
      [
        "CCN",
        "(C"
      ],
      [
        "c1nc(",
        "C)"
      ],
      [
        "C",
        "3"
      ],
      [
        "C",
        "#N"
      ],
      [
        "O",
        "1)"
      ],
      [
        "O",
        "c1ccc(cc1)"
      ],
      [
        "S",
        "C("
      ],
      [
        "1CC",
        "1"
      ],
      [
        "CO",
        "c1cc(C"
      ],
      [
        "c1ccc2c(c1",
        ")C"
      ],
      [
        "OC",
        ")O"
      ],
      [
        "=CC",
        "(=O)"
      ],
      [
        "c2c(n1)",
        "cccc2"
      ],
      [
        "#",
        "C"
      ],
      [
        "S",
        "CC(=O)N"
      ],
      [
        "CC",
        "c1ccccc1"
      ],
      [
        "CC",
        "1)C"
      ],
      [
        "CCN",
        "C(=O)"
      ],
      [
        "c2c(",
        "=O)"
      ],
      [
        "OC",
        ")OC"
      ],
      [
        "c1ncc",
        "c2"
      ],
      [
        "N",
        ")C"
      ],
      [
        "N",
        "CC1"
      ],
      [
        "CO",
        "c1c("
      ],
      [
        "CO",
        "c1cccc(c1)C"
      ],
      [
        "CO",
        "c1ccc2c(c1)"
      ],
      [
        "C2",
        "(CC"
      ],
      [
        "C)C",
        ")C"
      ],
      [
        "c1cn",
        "n(c1"
      ],
      [
        "=",
        "CC1"
      ],
      [
        "N",
        "C1"
      ],
      [
        "s",
        "1"
      ],
      [
        "c2",
        "c3"
      ],
      [
        "c1cccc",
        "n1)"
      ],
      [
        "c1ccccc1",
        ")O"
      ],
      [
        ")N",
        "C1CC"
      ],
      [
        "CCCC",
        "C2"
      ],
      [
        "c1c(",
        "O)"
      ],
      [
        "Br",
        ")C"
      ],
      [
        "c1nnc(",
        "o1)"
      ],
      [
        "CN(C",
        "1)C"
      ],
      [
        "(",
        "=C"
      ],
      [
        "CC",
        "CN1CC"
      ],
      [
        "c1nc2c(",
        "s1)"
      ],
      [
        "1",
        "C"
      ],
      [
        "1",
        "=N"
      ],
      [
        "N",
        "1)"
      ],
      [
        "n",
        "2)"
      ],
      [
        "s",
        "c1"
      ],
      [
        "CC",
        "(=O)O"
      ],
      [
        "c1ccc(",
        "n"
      ],
      [
        "c1ccc(",
        "s1)C"
      ],
      [
        "CN",
        "2"
      ],
      [
        "OCC",
        "O"
      ],
      [
        "C1CC",
        "2"
      ],
      [
        "c1nn",
        "c2"
      ],
      [
        "c1cc(C",
        ")n"
      ],
      [
        ")",
        "F"
      ],
      [
        "N",
        "c1nc("
      ],
      [
        "N",
        "S(=O)(=O)"
      ],
      [
        "C(",
        "C1)C"
      ],
      [
        "(C",
        "2"
      ],
      [
        "c1n",
        "cccc1"
      ],
      [
        "CO",
        "1"
      ],
      [
        "c(n",
        "c2"
      ],
      [
        "(=O)N",
        "1CC"
      ],
      [
        "[nH]",
        "c2"
      ],
      [
        "2)C",
        "(=O)"
      ],
      [
        "c1nnc(",
        "s1)"
      ],
      [
        "=S",
        ")"
      ],
      [
        "C(C1O)O",
        ")"
      ],
      [
        "(",
        "CCCC"
      ],
      [
        "N1CC",
        "CCC1"
      ],
      [
        "c1cc(",
        "F)"
      ],
      [
        "c1cc(",
        "O)"
      ],
      [
        "cc(",
        "cc1"
      ],
      [
        "c1s",
        "cc(n1)"
      ],
      [
        "cc(c1",
        ")C"
      ],
      [
        "N(C",
        "1)C"
      ],
      [
        "cccc1",
        "Cl"
      ],
      [
        "COc1cc(",
        "OC)"
      ],
      [
        "c1c[nH]",
        "c2c1cccc2"
      ],
      [
        "O",
        "N=C("
      ],
      [
        ")C",
        "c1ccccc1"
      ],
      [
        "C(",
        "=C"
      ],
      [
        "1CC",
        "N(CC1)C"
      ],
      [
        "c1ccccc1",
        "O"
      ],
      [
        "c1c(",
        "=O)"
      ],
      [
        "c1ccc(c(c1",
        ")OC"
      ],
      [
        "c1ccco",
        "1)"
      ],
      [
        ")",
        "Br"
      ],
      [
        "o",
        "c(=O)"
      ],
      [
        "c1cc",
        "(=O)"
      ],
      [
        "c(",
        "s"
      ],
      [
        ")C",
        "(=O)O"
      ],
      [
        "CO",
        "C(=O)C1"
      ],
      [
        "F)",
        "F"
      ],
      [
        "c1cc(",
        "OC)"
      ],
      [
        ")CC",
        "C"
      ],
      [
        "CCC",
        "="
      ],
      [
        "c1ncc",
        "s1"
      ],
      [
        "c1no",
        "c(n1)C"
      ],
      [
        "c1nc2c(",
        "[nH]1)"
      ],
      [
        "n1cn",
        "cc1"
      ],
      [
        "1",
        "CO"
      ],
      [
        "2",
        "c(n1)"
      ],
      [
        "C(",
        "C2"
      ],
      [
        "CCCC",
        "("
      ],
      [
        "OCC",
        "1)"
      ],
      [
        "c1cc(",
        "n"
      ],
      [
        "c1cc2",
        "cccc"
      ],
      [
        "c1ccc2c(c1)",
        "cccc2"
      ],
      [
        "N1",
        "C(=O)C"
      ],
      [
        "CC",
        "OCC"
      ],
      [
        "CC",
        "C1CC"
      ],
      [
        "c2",
        "c1cc"
      ],
      [
        "(C",
        ")O"
      ],
      [
        "CCCC",
        "C"
      ],
      [
        "c(n",
        "2)C"
      ],
      [
        "C)",
        "n"
      ],
      [
        "N1CC",
        "CC1"
      ],
      [
        "N1CC",
        "C(CC1)"
      ],
      [
        "c1[nH]",
        "n"
      ],
      [
        "n1cnc2",
        "c1ncnc2"
      ],
      [
        "(",
        "O)"
      ],
      [
        "N",
        "=C1"
      ],
      [
        "c",
        "s"
      ],
      [
        "CC",
        "CO"
      ],
      [
        "(C)C",
        ")N"
      ],
      [
        "c1c(",
        "F)"
      ],
      [
        "CCO",
        "c1ccccc1"
      ],
      [
        "CCC",
        "1)C"
      ],
      [
        "CN1CC",
        "N(CC1)"
      ],
      [
        "S(=O)(=O)N",
        "1CC"
      ],
      [
        "c1cc(C)",
        "ccc1"
      ],
      [
        "OCC1OC(",
        "C(C1O)O)"
      ],
      [
        "C",
        "=C"
      ],
      [
        "n",
        "2)C"
      ],
      [
        "C(=O)",
        "OCC"
      ],
      [
        "c1n",
        "c2ccccc2"
      ],
      [
        "O=C(",
        "C("
      ],
      [
        "Cl",
        "c1ccccc1"
      ],
      [
        "OC",
        "c1ccccc1"
      ],
      [
        "c1nc(",
        "N"
      ],
      [
        "c1s",
        "cc(n1)C"
      ],
      [
        "NC(",
        "=S)N"
      ],
      [
        "COc1cc2",
        "c(cc1"
      ],
      [
        "NC(=N",
        ")N"
      ],
      [
        "(",
        "n1)"
      ],
      [
        "C",
        "n1n"
      ],
      [
        "N",
        ")N"
      ],
      [
        "O",
        ")CC"
      ],
      [
        "n",
        "1)N"
      ],
      [
        "o",
        "2)C"
      ],
      [
        "c(",
        "O)"
      ],
      [
        "C(",
        "=S)N"
      ],
      [
        "(C",
        "1)C"
      ],
      [
        "c1n",
        "cn2"
      ],
      [
        "C1",
        "C2"
      ],
      [
        "CCCC",
        "C1"
      ],
      [
        "(=O)N",
        "C"
      ],
      [
        "OCC",
        "1CC"
      ],
      [
        "[nH]",
        "1"
      ],
      [
        "C1CC",
        "CCC1"
      ],
      [
        "cc(",
        "c2"
      ],
      [
        ")n",
        "c2"
      ],
      [
        "c1ccc(c(c1",
        ")O)O"
      ],
      [
        "c1ccc(cc1",
        "Cl)Cl"
      ],
      [
        "NC(=O)C",
        "1"
      ],
      [
        "c1ccco",
        "1)C"
      ],
      [
        "C(=O)O",
        ")N"
      ],
      [
        "c2c(c1=O)",
        "cccc2"
      ],
      [
        "Sc1nnc(",
        "n1"
      ],
      [
